{
  "day": 5,
  "topic": "Past Continuous (I was doing)",
  "sections": [
    {
      "title": "Introduction",
      "content": "Welcome to the sixth unit of our English learning journey. Today, we'll explore the Past Continuous tense, expressed as 'I was doing.'"
    },
    {
      "title": "Definition",
      "content": "This tense helps us describe actions that were in progress at a specific point in the past. Let's delve into the key concepts."
    },
    {
      "title": "Formation",
      "content": "The Present Simple tense is formed by using the base Subject + was/were + verb-ing",
      "points": [
        "Usage of 'was' for singular subjects (I, he, she, it) and 'were' for plural subjects (you, we, they).",
        "Usage of auxiliary verbs (did) in negative and interrogative sentences.",
        "I was studying when the phone rang"
      ]
    },
    {
      "title": "Usage",
      "content": "Actions in Progress: Describe actions that were ongoing at a particular moment in the past",
      "points": [
        "They were watching TV when I called.",
        "Parallel Actions: Express two or more actions happening simultaneously in the past.",
        "While she was cooking, he was cleaning"
      ]
    },
    {
      "title": "Examples",
      "content": "Let's examine examples to illustrate the application of the Past Continuous tense:",
      "examples": [
        {
          "Positive": "I was working on my project all afternoon",
          "Negative": "We were not playing soccer at that time",
          "Interrogative": "What were you doing when the lights went out?"
        }
      ]
    },
    {
      "title": "Time Expression",
      "content": "Understanding time expressions is crucial for placing actions in the past continuous tense.",
      "points": [
        "While, when, at that moment, at 3 PM yesterday"
      ]
    },
    {
      "title": "Common Mistakes",
      "content": "Address common mistakes to ensure learners use the past continuous tense accurately.",
      "points": [
        "Incorrect:I was studying when he called.",
        "Correct: 'I was studying when he called' (if the action was interrupted)"
      ]
    },
    {
      "title": "Recap and Summary:",
      "content": "In summary, the Past Continuous tense helps us describe actions in progress at a specific moment in the past. Pay attention to the use of 'was' and 'were' and practice incorporating this tense into your storytelling"
    },
    {
      "title": "Additional Resources:",
      "content": "For additional practice and reinforcement, consider exploring online exercises or referring to reliable grammar guides. "
    },
    {
      "title": "Conclusion",
      "content": "Thank you for joining today's lesson on the Past Continuous tense. Practice using it in various contexts, and feel free to reach out if you have any questions. Happy learning!"
    }
  ]
}